app/views/questions/index.html.erb

        <td><%= link_to question.title, question_answers_path(question) %></td>
        <td><%= question.created_at %></td>
---
INSERT INTO "questions" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"