app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"  ORDER BY "questions"."id" DESC
---
  def index
    @questions = Question.all

INSERT INTO "questions" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    question = question_params
    question[:user_id] = current_user.id

    @question = Question.create(question)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 5]]
UPDATE "questions" SET "user_id" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["user_id", 168], ["updated_at", "2015-03-26 21:28:33.667334"], ["id", 107]]
---
  def update
    question_id = params[:id]
    @question = Question.find(params[:id])

    question = question_params
    question[:user_id] = current_user.id

    if @question.update(question)